title: Suspicious PowerShell Base64 encoded script execution for Emotet
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: experimental
description: Detects suspicious PowerShell Base64 encoded script execution for Emotet
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    service: sysmon
    product: windows
detection:
    selection_1:
        CommandLine|contains:
            - 'bABFACgAJABpAEEAdwBEAG8AdwBBACwAIAAkAGgAUQBRAEEAQgBvADEAQQApADsAJABhAEMAUQB4ADQAQQA9ACgAKAAiAHsAMAB9AHsAMQB9ACIAIAAtAGYAJwBxAG8A'
            - 'YQBjAGgAKAAkAGkAQQB3AEQAbwB3AEEAIABpAG4AIAAkAFkAQgBBAEEAVQBfAEQAKQB7AHQAcgB5AHsAJABDAEEAYwBEAEEAQQAuAEQATwB3AE4AbABPAGEAZABGAGkA'
            - 'JwAsACgAJwBrACcAKwAnAEEAQgAnACkAKQArACcAQwB3ACcAKQA7AEkAZgAgACgAKAAmACgAJwBHAGUAdAAnACsAJwAtAEkAJwArACcAdABlAG0AJwApACAAJABoAFEA'
            - 'JwBvACcAKwAoACIAewAxAH0AewAwAH0AIgAtAGYAJwBtACcALAAoACcALgBjACcAKwAnAG8AJwApACkAKwAoACIAewAwAH0AewAxAH0AIgAtAGYAKAAnAC8AMQAnACsA'
            - 'MAB9AHsAMQB9ACIALQBmACgAJwByAGEAJwArACcAZgAnACkALAAnAGkAJwApACsAKAAiAHsAMAB9AHsAMQB9ACIAIAAtAGYAKAAnAGMAbwBzACcAKwAnAGEAJwApACwA'
            - 'KwAnADEAMwAnACkAOwAkAE8AUQBrAEEARABVAFUAWgA9ACgAKAAnAHEAJwArACcAQQB4ACcAKQArACcARAAnACsAKAAiAHsAMQB9AHsAMAB9ACIALQBmACcANABjACcA'
            - 'KwAoACcALgAnACsAKAAnAGUAeAAnACsAJwBlACcAKQApADsAJAB1AEEAQQA0AEEAUQA0AD0AKAAoACIAewAxAH0AewAwAH0AIgAgAC0AZgAgACcAeAAnACwAKAAnAEEA'
            - 'JABHAHgAUQBHAEIAQwBBAF8APQAoACgAJwBLAEMAJwArACcARAAnACkAKwAnAEQANAAnACsAJwAxACcAKQA7ACQAYwBrAEEANAAxAFEAUQBYACAAPQAgACgAJwA4ACcA'
            - 'JwBAACcAKwAnAGgAJwArACgAIgB7ADAAfQB7ADEAfQAiACAALQBmACAAJwB0ACcALAAoACcAdABwACcAKwAnADoAJwApACkAKwAnAC8AJwArACcALwAxACcAKwAoACIA'
            - 'LwAnACsAJwAvAGoAJwApACwAJwBwAG0AJwApACsAKAAnAHQAZQAnACsAJwBjACcAKQArACcAaAAnACsAKAAiAHsAMQB9AHsAMAB9AHsAMgB9ACIALQBmACgAJwAvAGMA'
            - 'JwApACAAbgBgAGUAVAAuAFcAZQBCAEMAYABsAGAASQBFAE4AdAA7ACQAWQBCAEEAQQBVAF8ARAA9ACgAKAAiAHsAMAB9AHsAMQB9ACIAIAAtAGYAKAAnAGgAdAAnACsA'
            - 'JwBzACcAKQArACgAIgB7ADAAfQB7ADEAfQAiACAALQBmACgAJwBzACcAKwAnAG8AYwAnACkALAAnAGkAJwApACsAKAAiAHsAMQB9AHsAMgB9AHsAMAB9ACIALQBmACAA'
            - 'ZgAgACcAQAAnACwAJwAvACcALAAoACcAdAB0AHAAJwArACcAOgAvAC8AcAAnACsAJwB1AHIAJwApACwAJwBoACcAKQArACcAaQAnACsAJwBtAGEAJwArACcAcgAnACsA'
            - 'JwAvACcAKQAsACcAdwB3ACcAKQArACgAJwAvACcAKwAnAEAAaAAnACkAKwAoACcAdAB0ACcAKwAnAHAAJwApACsAKAAiAHsAMAB9AHsAMQB9ACIAIAAtAGYAKAAnADoA'
            - 'KAAnAC4AMQA2ACcAKwAnADYALwAnACkALAAnADIAMQAnACkAKwAoACIAewAyAH0AewAwAH0AewAxAH0AIgAtAGYAJwBwAC0AJwAsACgAJwBpAG4AJwArACcAYwAnACkA'
            - 'aAAnACkAKQArACcAbwAnACsAJwBiAGkAJwArACcAYQAnACsAKAAiAHsAMgB9AHsAMQB9AHsAMAB9ACIALQBmACAAKAAnAGkAJwArACcAbQBhACcAKQAsACcAbQAvACcA'
    selection_2:
        EventID: 1
        CommandLine|startswith:
            - 'powErSHell -e'
    condition: all of selection_*
level: high